tap "jesseduffield/lazygit"
tap "localstack/tap"
tap "mongodb/brew"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "awscli"
brew "azure-cli"
brew "bat"
brew "coreutils"
brew "fd"
brew "fzf"
brew "gh"
brew "go"
brew "helm"
brew "kubernetes-cli"
brew "kubectx"
brew "lazygit"
brew "lua-language-server"
brew "mongocli"
brew "node"
brew "mongosh"
brew "neovim"
brew "ripgrep"
brew "opencode"
brew "pandoc"
brew "pyenv"
brew "rust"
brew "stow"
brew "tmux"
brew "tree"
brew "vscode-langservers-extracted"
brew "yarn"
brew "zlib"
brew "zoxide"
brew "localstack/tap/localstack-cli"
brew "mongodb/brew/mongodb-database-tools"
cask "copilot-cli"
cask "karabiner-elements"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "k--kato.intellij-idea-keybindings"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "svelte.svelte-vscode"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/gopls"
