tap "anomalyco/tap"
tap "azure/kubelogin"
tap "localstack/tap"
tap "mongodb/brew"
brew "awscli"
brew "azure-cli"
brew "bat"
brew "coreutils"
brew "fd"
brew "fzf"
brew "gh"
brew "go@1.24", link: true
brew "helm"
brew "kubernetes-cli"
brew "kubectx"
brew "lazygit"
brew "lua-language-server"
brew "node"
brew "neovim"
brew "pandoc"
brew "pyenv"
brew "ripgrep"
brew "rust"
brew "stow"
brew "tmux"
brew "tree"
brew "vscode-langservers-extracted"
brew "watch"
brew "yarn"
brew "zoxide"
brew "anomalyco/tap/opencode"
brew "azure/kubelogin/kubelogin"
brew "localstack/tap/localstack-cli"
brew "mongodb/brew/mongodb-community"
cask "bruno"
cask "camtasia"
cask "copilot-cli"
cask "discord"
cask "ghostty"
cask "google-chrome"
cask "grammarly-desktop"
cask "karabiner-elements"
cask "raycast"
cask "slack"
cask "snagit"
cask "visual-studio-code"
cask "zen"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "k--kato.intellij-idea-keybindings"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "svelte.svelte-vscode"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
go "github.com/spf13/cobra-cli"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/neilsmahajan/typing-test-tui"
